{
  "general": {
    "1": "The process encountered an internal error and was unable to complete the request.",
    "2": "The process encountered an unexpected condition that prevented it from completing the request.",
    "3": "Null arrays cannot be provided to getRandom",
    "4": "App name is not defined",
    "5": "useStorm is not available in this environment",
    "6": "The %s function%s must be configured. Please add .%s(<your_function>) before .build() is called.",
    "7": "No payload found in %s request",
    "8": "The application version could not be determined",
    "9": "Null arrays cannot be provided to getRandom",
    "10": "Unable to resolve type %s in %s. Please check the path and try again.",
    "11": "Invalid log level: \"%s\"",
    "12": "Unable to access context. Please ensure it was initialized prior to its use.",
    "13": "The \"CLOUDFLARE_ACCOUNT_ID\" variable must be defined to use %s via the Cloudflare v4 API.",
    "14": "The \"CLOUDFLARE_API_TOKEN\", \"CLOUDFLARE_EMAIL\"/\"CLOUDFLARE_API_KEY\", or \"CLOUDFLARE_USER_SERVICE_KEY\" variable must be defined to use Cloudflare KV storage via the Cloudflare v4 API.",
    "15": "The \"CLOUDFLARE_R2_ACCESS_KEY_ID\" and \"CLOUDFLARE_R2_SECRET_ACCESS_KEY\" variables must be defined to use Cloudflare R2 storage via the Cloudflare v4 API.",
    "16": "Unknown prompt type: \"%s\"",
    "17": "The cache directory could not be determined.",
    "18": "The Storm Stack project has not been prepared. Please run the `prepare` command before trying to lint the project.",
    "19": "The Storm Stack project has not been prepared. Please run the `prepare` command before trying to build the project.",
    "20": "An error occurred while installing the build plugin package \"%s\" ",
    "21": "The plugin package \"%s\" is not installed. Please install the package using the command: \"npm install %s --save-dev\"",
    "22": "An error occurred while importing the build plugin package \"%s\":\n%s\n\nNote: Please ensure the plugin package's default export is a class that extends Plugin with a constructor that excepts zero arguments.",
    "23": "The plugin package \"%s\" does not export a valid module.",
    "24": "The module in the build plugin package \"%s\" must export a name string value.",
    "25": "The build plugin \"%s\" must export an addHooks function.",
    "26": "An error occured while starting the build process for the Storm Stack project",
    "27": "An error occured while starting the new process to add a Storm Stack project",
    "28": "Cannot find the tsconfig.json configuration file at %s",
    "29": "An error occured while starting the prepare process for the Storm Stack project",
    "30": "An error occured while starting to generate documentation for the Storm Stack project",
    "31": "An error occured while starting the finalize process for the Storm Stack project",
    "32": "An error occured while starting the lint process for the Storm Stack project",
    "33": "An error occured while starting initialization for the Storm Stack project",
    "34": "An error occured while finishing the build process for the Storm Stack project",
    "35": "Could not resolve the Storm Stack core package. Please ensure it is installed.",
    "36": "An error occured while creating entry artifacts",
    "37": "An error occured while starting the clean process for the Storm Stack project",
    "38": "An error occured while finishing generation of documentation for the Storm Stack project",
    "39": "An error occured while finishing the finalize process for the Storm Stack project",
    "40": "An error occured while finishing the lint process for the Storm Stack project",
    "41": "An error occured while pre-transforming the Storm Stack project",
    "42": "An error occured while finishing the new process to add a Storm Stack project",
    "43": "An error occured while creating deployment artifacts",
    "44": "An error occured while finishing the clean process for the Storm Stack project",
    "45": "An error occured while transforming the Storm Stack project",
    "46": "An error occured while creating miscellaneous artifacts",
    "47": "An error occured while building the Storm Stack application",
    "48": "An error occured while building the Storm Stack library",
    "49": "The dotenv reflection file \"%s\" does not exist. Please run the \"prepare\" command to generate the dotenv reflection file.",
    "50": "An error occured while post-transforming the Storm Stack project",
    "51": "Failed to parse the TypeScript configuration file.",
    "52": "An error occured while running ESLint on the Storm Stack project",
    "53": "An error occured while writing the Dotenv documentation for the Storm Stack project artifacts",
    "54": "An error occured while writing the API-Reference documentation for the Storm Stack project artifacts",
    "55": "An error occured while finishing initialization for the Storm Stack project",
    "56": "An error occured while finishing the prepare process for the Storm Stack project",
    "57": "An error occured while cleaning the Storm Stack project output",
    "58": "An error occured while cleaning the Storm Stack project generated documentation",
    "59": "An error occured while cleaning the Storm Stack project artifacts",
    "60": "An error occured while creating a new Storm Stack library project",
    "61": "An error occured while creating a new Storm Stack application project",
    "62": "An error occured while installing project dependencies",
    "63": "The TypeScript package is not installed. Please install the package using the command: \"npm install typescript --save-dev\"",
    "64": "An error occured while initializing Unimport for the Storm Stack project configuration",
    "65": "An error occurred while initializing the dotenv configuration for the Storm Stack project",
    "66": "An error occurred while initializing the entry points for the Storm Stack project",
    "67": "An error occurred while initializing the workers for the Storm Stack project",
    "68": "Transform is null: %s",
    "69": "The package.json file is missing in the project root directory: %s. Please run the \"new\" command to create a new Storm Stack project.",
    "70": "An error occurred while preparing the artifact directories for the Storm Stack project",
    "71": "An error occurred while preparing the reflection artifacts for the Storm Stack project",
    "72": "An error occurred while preparing the type declarations for the Storm Stack project",
    "73": "An error occurred while preparing the runtime artifacts for the Storm Stack project",
    "74": "An error occured while resolving the TypeScript options",
    "75": "An error occurred while initializing the context for the Storm Stack project",
    "76": "An error occurred while installing the package \"%s\"",
    "77": "Farm is ended, no more calls can be done to it",
    "78": "Invalid type definition for secrets found in `dotenv.types.secrets` of the provided configuration.",
    "79": "Cache directory is not writable: %s",
    "80": "Environment variable %s is not defined in the .env configuration files",
    "81": "Environment variables are not defined in the dotenv type definition but is used in the code: %s The following variable names are defined in the dotenv type definition: %s Using the following env prefix: %s Please check your dotenv configuration option. If you are using a custom dotenv type definition, please make sure that the variable names match the ones in the code. ",
    "82": "Module not found: %s. Please check the path and try again.",
    "83": "Failed to transpile %s: %s",
    "84": "Prompt cancelled.",
    "85": "Cannot find the tsconfig.json configuration file at %s or %s"
  },
  "not_found": {
    "1": "The requested resource was not found.",
    "2": "The requested resource does not exist."
  },
  "security": {
    "1": "The request has been refused due to invalid authorization.",
    "2": "The request requires user authentication.",
    "3": "The provided credentials are invalid."
  },
  "validation": {
    "1": "The request was not processed due to validation errors.",
    "2": "The request was rejected due to validation errors.",
    "3": "The server cannot or will not process the request due to a client error.",
    "4": "The request could not be understood by the server due to malformed syntax."
  },
  "unknown": {
    "1": "The process encountered an unknown issue that prevented it from completing the request."
  },
  "service_unavailable": {
    "1": "The server is currently unable to process the request.",
    "2": "The server is currently unable to handle the request due to temporary overloading or maintenance of the server."
  },
  "action_unsupported": {
    "1": "The requested action is not supported.",
    "2": "The requested action is not allowed."
  }
}
